nxp-mcuxpresso/mcux-sdk/components/power_manager/devices/MIMXRT735S/fsl_pm_device.c
    [kResc_V2NMED - RESC_GROUP_PERIPHERALS_START]  = {1U, PMC_PDSLEEPCFG0_V2NMED_DSR_MASK},
    [kResc_VNCOM - RESC_GROUP_PERIPHERALS_START]   = {1U, PMC_PDSLEEPCFG0_VNCOM_DSR_MASK},
    [kResc_V2DSP - RESC_GROUP_PERIPHERALS_START]   = {1U, PMC_PDSLEEPCFG0_V2DSP_PD_MASK},
    [kResc_V2MIPI - RESC_GROUP_PERIPHERALS_START]  = {1U, PMC_PDSLEEPCFG0_V2MIPI_PD_MASK},
    [kResc_DCDC_HP - RESC_GROUP_PERIPHERALS_START] = {1U, PMC_PDSLEEPCFG0_DCDC_LP_MASK},

    [kResc_PMC_TEMP - RESC_GROUP_PERIPHERALS_START]   = {2U, PMC_PDSLEEPCFG1_TEMP_PD_MASK},
    [kResc_PMCREF_HP - RESC_GROUP_PERIPHERALS_START]  = {2U, PMC_PDSLEEPCFG1_PMCREF_LP_MASK},
    [kResc_HVD1V8 - RESC_GROUP_PERIPHERALS_START]     = {2U, PMC_PDSLEEPCFG1_HVD1V8_PD_MASK},
    [kResc_PORVDD1_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_POR1_LP_MASK},
    [kResc_LVDVDD1_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_LVD1_LP_MASK},
    [kResc_HVDVDD1 - RESC_GROUP_PERIPHERALS_START]    = {2U, PMC_PDSLEEPCFG1_HVD1_PD_MASK},
    [kResc_AGDET1 - RESC_GROUP_PERIPHERALS_START]     = {2U, PMC_PDSLEEPCFG1_AGDET1_PD_MASK},
    [kResc_PORVDD2_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_POR2_LP_MASK},
    [kResc_LVDVDD2_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_LVD2_LP_MASK},
    [kResc_HVDVDD2 - RESC_GROUP_PERIPHERALS_START]    = {2U, PMC_PDSLEEPCFG1_HVD2_PD_MASK},
    [kResc_AGDET2 - RESC_GROUP_PERIPHERALS_START]     = {2U, PMC_PDSLEEPCFG1_AGDET2_PD_MASK},
    [kResc_PORVDDN_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_PORN_LP_MASK},
    [kResc_LVDVDDN_HP - RESC_GROUP_PERIPHERALS_START] = {2U, PMC_PDSLEEPCFG1_LVDN_LP_MASK},
    [kResc_HVDVDDN - RESC_GROUP_PERIPHERALS_START]    = {2U, PMC_PDSLEEPCFG1_HVDN_PD_MASK},
    [kResc_OTP - RESC_GROUP_PERIPHERALS_START]        = {2U, PMC_PDSLEEPCFG1_OTP_PD_MASK},
    [kResc_ROM - RESC_GROUP_PERIPHERALS_START]        = {2U, PMC_PDSLEEPCFG1_ROM_PD_MASK},
};

/*******************************************************************************
 * Code
 ******************************************************************************/

static void PM_DEV_EnablePeripheralsDeepSleep(pm_resc_mask_t *pSoftRescMask,
                                              pm_resc_group_t *pSysRescGroup,
                                              uint32_t *enabledResources)
{
    uint32_t rescMask;
    uint32_t rescGroup;
    resc_name_t resc;
    uint32_t feature;

    /* Configure System RAMs */
    for (resc = RESC_GROUP_SRAMS_START; resc <= RESC_GROUP_SRAMS_END; resc++)
    {
        rescMask  = PM_RESC_MASK(pSoftRescMask, resc);
        rescGroup = PM_RESC_GROUP(pSysRescGroup, resc);
        feature   = (uint32_t)resc - (uint32_t)RESC_GROUP_SRAMS_START;

        if ((rescMask != 0U) && ((rescGroup & PM_RESOURCE_FULL_ON) != 0U))
        {
            /* Exclude APD & PPD bits in PDSLEEPCFG for each enabled SRAM */
            enabledResources[enResSRAMs[feature].group] |= enResSRAMs[feature].mask;
            enabledResources[enResSRAMs[feature].group + 1UL] |= enResSRAMs[feature].mask;
        }
        else if ((rescMask != 0U) && ((rescGroup & PM_RESOURCE_PARTABLE_ON1) != 0U))
        {
            /* Exclude APD bit in PDSLEEPCFG2/4 for each retained SRAM */
            enabledResources[enResSRAMs[feature].group] |= enResSRAMs[feature].mask;
        }
        else
        {
            /* Intentional empty. */
        }
    }

    /* Configure remaining peripherals */
    for (resc = RESC_GROUP_PERIPHERALS_START; resc <= RESC_GROUP_PERIPHERALS_END; resc++)
    {
        rescMask  = PM_RESC_MASK(pSoftRescMask, resc);
        rescGroup = PM_RESC_GROUP(pSysRescGroup, resc);
        feature   = (uint32_t)resc - (uint32_t)RESC_GROUP_PERIPHERALS_START;

        if ((rescMask != 0U) && ((rescGroup & PM_RESOURCE_FULL_ON) != 0U))
        {
            /* Exclude peripheral bit in corresponding PDSLEECFG group */
            enabledResources[enResPeripherals[feature].group] |= enResPeripherals[feature].mask;
        }
    }
}

static void PM_DEV_DisablePeripheralsSleep(pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    uint32_t rescMask;
    uint32_t rescGroup;
    resc_name_t resc;
    uint32_t feature;

    /* Configure System RAMs (SRAMs) */
    for (resc = RESC_GROUP_SRAMS_START; resc <= RESC_GROUP_SRAMS_END; resc++)
    {
        rescMask  = PM_RESC_MASK(pSoftRescMask, resc);
        rescGroup = PM_RESC_GROUP(pSysRescGroup, resc);
        feature   = (uint32_t)resc - (uint32_t)RESC_GROUP_SRAMS_START;

        if (rescMask != 0U)
        {
            if ((rescGroup & PM_RESOURCE_FULL_ON) != 0U)
            {
                /* Clear APD bit in PDRUNCFG and PPD bit for each enabled SRAM */
                PMC_PDRCFG_REG(enResSRAMs[feature].group - 1UL) &= ~enResSRAMs[feature].mask;
                PMC_PDRCFG_REG(enResSRAMs[feature].group) &= ~enResSRAMs[feature].mask;
            }
            else if ((rescGroup & PM_RESOURCE_PARTABLE_ON1) != 0U)
            {
                /* Clear APD bit in PDRUNCFG for each retained SRAM */
                PMC_PDRCFG_REG(enResSRAMs[feature].group - 1UL) &= ~enResSRAMs[feature].mask;
                /* Set PPD bit in PDRUNCFG for each retained SRAM */
                PMC_PDRCFG_REG(enResSRAMs[feature].group) |= enResSRAMs[feature].mask;
            }
            else
            {
                /* Intentional empty. */
            }
        }
        else
        {
            /* Set APD bit and PPD bit in PDRUNCFG for each disabled SRAM */
            PMC_PDRCFG_REG(enResSRAMs[feature].group - 1UL) |= enResSRAMs[feature].mask;
            PMC_PDRCFG_REG(enResSRAMs[feature].group) |= enResSRAMs[feature].mask;
        }
    }

    /* Configure remaining peripherals with single PDRUNCFG bit */
    for (resc = RESC_GROUP_PERIPHERALS_START; resc <= RESC_GROUP_PERIPHERALS_END; resc++)
    {
        rescMask  = PM_RESC_MASK(pSoftRescMask, resc);
        rescGroup = PM_RESC_GROUP(pSysRescGroup, resc);
        feature   = (uint32_t)resc - (uint32_t)RESC_GROUP_PERIPHERALS_START;

